/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *  Адаптировано под Keil 5 DeamonClub.RU
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл systick.c: Утилиты нижнего уровня для работы с системным таймером
 *
 *============================================================================================*/

#include "MDR32Fx.h"                    // Device header
//#include "MDR32F9Qx_config.h"           // Keil::Device:Startup_MDR1986BE9x
//#include "core_cm3.h"                   // Keil::Device:Startup_MDR1986BE9x

#include "systick.h"

// Счетчик ожидания 
static vu32 TimerCounter = 0;

// Управление системным таймером 
void SysTickStart(u32 ticks) {
    SysTick_Config(ticks);
}


void SysTickStop(void) {
    SysTick->CTRL &= ~SYSTICK_CSR_ENABLE;
}


// Обработчик прерывания SYSTICK 
void SysTick_Handler(void) {
    if (TimerCounter)
        TimerCounter--;
}


// Функция задержки (на базе systick)
void SysTickDelay(u32 ticks) {
    if (ticks) {
        TimerCounter = ticks;
        SysTickStart(ticks);
        while (TimerCounter);
        SysTickStop();
    }
}


/*============================================================================================
 * Конец файла systick.c
 *============================================================================================*/

